tutorials/Couette/Concentric/1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

R   2.38;
R0  0.64;
theta #calc "1.0/180*3.14"; // cos(theta) ~ 1 e sin(theta) ~ 3e-4


vertices
(

    (#calc "$R0*cos($theta)" #calc "-$R0*sin($theta)" 0) 
     (#calc "$R*cos($theta)" #calc "-$R*sin($theta)" 0) 

    (#calc "$R*cos($theta)" #calc "$R*sin($theta)" 0)



    (#calc "$R0*cos($theta)" #calc "$R0*sin($theta)" 0)


    (#calc "$R0*cos($theta)" #calc "-$R0*sin($theta)" 1)
    (#calc "$R*cos($theta)" #calc "-$R*sin($theta)" 1)

    (#calc "$R*cos($theta)" #calc "$R*sin($theta)" 1)
    (#calc "$R0*cos($theta)" #calc "$R0*sin($theta)" 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (56 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(



   rotatingWall
   {
       type wall;
       faces
       (
          (0 4 7 3)
       );
   }
   
   
   
   fixedWall
   {
       type wall;
       faces
       (
          (1 5 6 2)
       );
   }
   
   
   front
   {
       type wedge;
       faces
       (
          (3 2 6 7)
       );
   }
   
   
   back
   {
      type wedge;
      faces
      (
          (0 4 5 1)
      );
   }
   
   
   upAndDown
   {
      type empty;
      faces
      (
          (7 6 5 4)
          (0 1 2 3)
      );
   }

);

mergePatchPairs
(
);

// ************************************************************************* //
