tutorials/Couette/Concentric/1D/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      c; // concentration
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.55;  

boundaryField
{
    rotatingWall       
    {
        type            slip;
    }

    fixedWall       
    {
        type            slip;
    }

    upAndDown    
    {
        type            empty;
    }
    
    "front|back"
    {
        type            wedge;
    }
}

// ************************************************************************* //
